valentindanev/esp32_sonar_bridge/firmware/main/main.c
/*
 *   This file is part of DroneBridge: https://github.com/DroneBridge/ESP32
 *
 *   Copyright 2018 Wolfgang Christl
 *
 *   Licensed under the Apache License, Version 2.0 (the "License");
 *   you may not use this file except in compliance with the License.
 *   You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 *   Unless required by applicable law or agreed to in writing, software
 *   distributed under the License is distributed on an "AS IS" BASIS,
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *   See the License for the specific language governing permissions and
 *   limitations under the License.
 *
 */

#include <driver/gpio.h>
#include <esp_wifi_types.h>
#include <lwip/apps/netbiosns.h>
#include <nvs_flash.h>
#include <stdio.h>
#include <string.h>

#include "db_esp32_control.h"
#include "db_protocol.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_mac.h"
#include "esp_spiffs.h"
#include "esp_vfs_semihost.h"
#include "esp_wifi.h"
#include "esp_wifi_default.h"
#include "esp_wifi_types.h"
#include "freertos/event_groups.h"
#include "http_server.h"
#include "main.h"

#include <button_gpio.h>
#include <iot_button.h>

#include "deeper_udp_sonar.h"
#include "danevi_sonar.h"
#include "db_esp_now.h"
#include "db_parameters.h"
#include "db_serial.h"
#include "globals.h"
#include "mdns.h"

#include <db_timers.h>

#ifdef CONFIG_BT_ENABLED

#include "db_ble.h"

#endif

#define NVS_NAMESPACE "settings"

/* used to reset ESP to defaults and force restart or to reset the mode to
 * access point mode */
#ifdef CONFIG_IDF_TARGET_ESP32C3
#define DB_RESET_PIN GPIO_NUM_9
#elif CONFIG_IDF_TARGET_ESP32C6
#define DB_RESET_PIN GPIO_NUM_9
#elif CONFIG_IDF_TARGET_ESP32S2
#define DB_RESET_PIN GPIO_NUM_0
#elif CONFIG_IDF_TARGET_ESP32S3
#define DB_RESET_PIN GPIO_NUM_0
#elif CONFIG_IDF_TARGET_ESP32
#define DB_RESET_PIN GPIO_NUM_0
#else
#define DB_RESET_PIN GPIO_NUM_0
#endif

static const char *TAG = "DB_ESP32";

char CURRENT_CLIENT_IP[IP4ADDR_STRLEN_MAX] = "192.168.2.1";
uint8_t DB_RADIO_IS_OFF = false; // keep track if we switched Wi-Fi/BLE off
                                 // already - by default a radio is started
db_esp_signal_quality_t db_esp_signal_quality = {.air_rssi = UINT8_MAX,
                                                 .air_noise_floor = UINT8_MAX,
                                                 .gnd_rssi = UINT8_MAX,
                                                 .gnd_noise_floor = UINT8_MAX};
wifi_sta_list_t wifi_sta_list = {.num = 0};
uint8_t LOCAL_MAC_ADDRESS[6];

// Wi-Fi client mode vars
static int s_retry_num = 0;
static EventGroupHandle_t s_wifi_event_group;
#define WIFI_CONNECTED_BIT BIT0
#define WIFI_FAIL_BIT BIT1

esp_netif_t *esp_default_netif;
static esp_event_handler_instance_t s_wifi_any_id_handler;
static esp_event_handler_instance_t s_sta_got_ip_handler;
static esp_event_handler_instance_t s_ap_staipassigned_handler;

static bool db_is_deeper_sta_target(void) {
  return DB_PARAM_DEEPER_EN &&
         strcmp(DB_PARAM_WIFI_SSID, DB_PARAM_DEEPER_SSID) == 0;
}

static const char *db_wifi_password_for_log(void) {
  if (db_is_deeper_sta_target()) {
    return strlen(DB_PARAM_PASS) > 0 ? "<configured>" : "<open>";
  }
  return DB_PARAM_PASS;
}

static bool db_wifi_runtime_has_sta(void) {
  wifi_mode_t mode = WIFI_MODE_NULL;
  return esp_wifi_get_mode(&mode) == ESP_OK &&
         (mode == WIFI_MODE_STA || mode == WIFI_MODE_APSTA);
}

static esp_err_t db_set_dns_server(esp_netif_t *netif, uint32_t addr,
                                   esp_netif_dns_type_t type) {
  if (addr && (addr != IPADDR_NONE)) {
    esp_netif_dns_info_t dns;
    dns.ip.u_addr.ip4.addr = addr;
    dns.ip.type = IPADDR_TYPE_V4;
    ESP_ERROR_CHECK(esp_netif_set_dns_info(netif, type, &dns));
  }
  return ESP_OK;
}

static void db_copy_cstr(char *dst, size_t dst_size, const char *src) {
  if (dst == NULL || dst_size == 0) {
    return;
  }
  if (src == NULL) {
    dst[0] = '\0';
    return;
  }
  strncpy(dst, src, dst_size - 1);
  dst[dst_size - 1] = '\0';
}

static void db_unregister_wifi_handlers(void) {
  if (s_wifi_any_id_handler != NULL) {
    ESP_ERROR_CHECK_WITHOUT_ABORT(esp_event_handler_instance_unregister(
        WIFI_EVENT, ESP_EVENT_ANY_ID, s_wifi_any_id_handler));
    s_wifi_any_id_handler = NULL;
  }
  if (s_sta_got_ip_handler != NULL) {
    ESP_ERROR_CHECK_WITHOUT_ABORT(esp_event_handler_instance_unregister(
        IP_EVENT, IP_EVENT_STA_GOT_IP, s_sta_got_ip_handler));
    s_sta_got_ip_handler = NULL;
  }
  if (s_ap_staipassigned_handler != NULL) {
    ESP_ERROR_CHECK_WITHOUT_ABORT(esp_event_handler_instance_unregister(
        IP_EVENT, IP_EVENT_AP_STAIPASSIGNED, s_ap_staipassigned_handler));
    s_ap_staipassigned_handler = NULL;
  }
}

static void db_cleanup_wifi_runtime(void) {
  db_unregister_wifi_handlers();

  esp_err_t err = esp_wifi_stop();
  if (err != ESP_OK && err != ESP_ERR_WIFI_NOT_INIT &&
      err != ESP_ERR_WIFI_NOT_STARTED) {
    ESP_LOGW(TAG, "esp_wifi_stop during cleanup failed: %s",
             esp_err_to_name(err));
  }

  if (esp_default_netif != NULL) {
    esp_netif_destroy_default_wifi(esp_default_netif);
    esp_default_netif = NULL;
  }

  err = esp_wifi_deinit();
  if (err != ESP_OK && err != ESP_ERR_WIFI_NOT_INIT) {
    ESP_LOGW(TAG, "esp_wifi_deinit during cleanup failed: %s",
             esp_err_to_name(err));
  }

  err = esp_event_loop_delete_default();
  if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
    ESP_LOGW(TAG, "esp_event_loop_delete_default during cleanup failed: %s",
             esp_err_to_name(err));
  }

  if (s_wifi_event_group != NULL) {
    vEventGroupDelete(s_wifi_event_group);
    s_wifi_event_group = NULL;
  }

  s_retry_num = 0;
}

/**
 * Assigns static IP to ESP32 when in client mode and static IP, GW and netmask
 * are set in config. Stops client DHCP server
 */
static void set_client_static_ip() {
  if (db_wifi_runtime_has_sta() &&
      strlen((char *)DB_PARAM_STA_IP) > 0 &&
      strlen((char *)DB_PARAM_STA_GW) > 0 &&
      strlen((char *)DB_PARAM_STA_IP_NETMASK) > 0) {
    ESP_LOGI(
        TAG,
        "Assigning static IP to ESP32: ESP32-IP: %s Gateway: %s Netmask: %s",
        (char *)DB_PARAM_STA_IP, (char *)DB_PARAM_STA_GW,
        (char *)DB_PARAM_STA_IP_NETMASK);

    if (esp_netif_dhcpc_stop(esp_default_netif) != ESP_OK) {
      ESP_LOGE(TAG, "Failed to stop dhcp client in order to set static IP");
      return;
    }
    esp_netif_ip_info_t ip;
    memset(&ip, 0, sizeof(esp_netif_ip_info_t));
    ip.ip.addr = ipaddr_addr((char *)DB_PARAM_STA_IP);
    ip.netmask.addr = ipaddr_addr((char *)DB_PARAM_STA_IP_NETMASK);
    ip.gw.addr = ipaddr_addr((char *)DB_PARAM_STA_GW);
    if (esp_netif_set_ip_info(esp_default_netif, &ip) != ESP_OK) {
      ESP_LOGE(TAG, "Failed to set static ip info");
    }
    ESP_LOGD(TAG, "Success to set static ip: %s, netmask: %s, gw: %s",
             (char *)DB_PARAM_STA_IP, (char *)DB_PARAM_STA_IP_NETMASK,
             (char *)DB_PARAM_STA_GW);
    ESP_ERROR_CHECK(db_set_dns_server(esp_default_netif,
                                      ipaddr_addr((char *)DB_PARAM_STA_GW),
                                      ESP_NETIF_DNS_MAIN));
    ESP_ERROR_CHECK(db_set_dns_server(esp_default_netif, ipaddr_addr("0.0.0.0"),
                                      ESP_NETIF_DNS_BACKUP));
  } else {
    // no static IP specified let the DHCP assign us one
  }
}

/**
 * Devices get added based on IP (check if IP & PORT are already listed) and
 * removed from the UDP broadcast connection based on MAC address
 *
 * @param arg
 * @param event_base
 * @param event_id
 * @param event_data
 */
static void wifi_event_handler(void *arg, esp_event_base_t event_base,
                               int32_t event_id, void *event_data) {
  // Wifi access point mode events
  if (event_id == WIFI_EVENT_AP_STACONNECTED) {
    wifi_event_ap_staconnected_t *event =
        (wifi_event_ap_staconnected_t *)event_data;
    ESP_LOGI(TAG, "WIFI_EVENT - Client connected - station:" MACSTR ", AID=%d",
             MAC2STR(event->mac), event->aid);
    ESP_ERROR_CHECK_WITHOUT_ABORT(esp_wifi_ap_get_sta_list(
        &wifi_sta_list)); // update list of connected stations
  } else if (event_id == WIFI_EVENT_AP_STADISCONNECTED) {
    wifi_event_ap_stadisconnected_t *event =
        (wifi_event_ap_stadisconnected_t *)event_data;
    ESP_LOGI(TAG,
             "WIFI_EVENT - Client disconnected - station:" MACSTR ", AID=%d",
             MAC2STR(event->mac), event->aid);
    struct db_udp_client_t db_udp_client;
    memcpy(db_udp_client.mac, event->mac, sizeof(db_udp_client.mac));
    remove_from_known_udp_clients(udp_conn_list, db_udp_client);
    ESP_ERROR_CHECK_WITHOUT_ABORT(esp_wifi_ap_get_sta_list(
        &wifi_sta_list)); // update list of connected stations
  } else if (event_id == WIFI_EVENT_AP_START) {
    ESP_LOGI(TAG, "WIFI_EVENT_AP_START (SSID: %s PASS: %s)", DB_PARAM_WIFI_SSID,
             DB_PARAM_PASS);
  } else if (event_id == WIFI_EVENT_AP_STOP) {
    ESP_LOGI(TAG, "WIFI_EVENT - AP stopped!");
  } else if (event_base == IP_EVENT && event_id == IP_EVENT_AP_STAIPASSIGNED) {
    ip_event_ap_staipassigned_t *event =
        (ip_event_ap_staipassigned_t *)event_data;
    ESP_LOGI(TAG, "IP_EVENT_AP_STAIPASSIGNED - New station IP:" IPSTR,
             IP2STR(&event->ip));
    ESP_LOGI(TAG, "IP_EVENT_AP_STAIPASSIGNED - MAC: " MACSTR,
             MAC2STR(event->mac));
    struct db_udp_client_t db_udp_client;
    db_udp_client.udp_client.sin_family = PF_INET;
    db_udp_client.udp_client.sin_port = htons(APP_PORT_PROXY_UDP);
    db_udp_client.udp_client.sin_len = 16;
    db_udp_client.udp_client.sin_addr.s_addr = event->ip.addr;
    memcpy(db_udp_client.mac, event->mac, sizeof(db_udp_client.mac));
    add_to_known_udp_clients(udp_conn_list, db_udp_client, false);
  }
  // Wifi client mode events
  if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
    ESP_LOGI(TAG, "WIFI_EVENT_STA_START - Wifi Started");
    if (!DB_RADIO_IS_OFF) { // maybe the other task did set it in the meantime
      ESP_ERROR_CHECK_WITHOUT_ABORT(esp_wifi_connect());
    } else {
      ESP_LOGW(TAG, "Did not start Wi-Fi since autopilot told us he is armed "
                    "(WIFI_EVENT_STA_START)");
    }
  } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_CONNECTED) {
    set_client_static_ip();
  } else if (event_base == WIFI_EVENT &&
             event_id == WIFI_EVENT_STA_DISCONNECTED) {
    wifi_event_sta_disconnected_t *event =
        (wifi_event_sta_disconnected_t *)event_data;
    ESP_LOGI(TAG,
             "WIFI_EVENT_STA_DISCONNECTED - Lost connection to access point "
             "(reason: %d)",
             event->reason);
    // Keep on trying
    if (!DB_RADIO_IS_OFF) {
      if (s_retry_num < 15) {
        ESP_ERROR_CHECK_WITHOUT_ABORT(esp_wifi_connect());
        s_retry_num++;
        ESP_LOGI(TAG, "Retry to connect to the AP (%i)", s_retry_num);
      } else {
        ESP_LOGW(TAG, "Max retries reached. Triggering fall-back!");
        xEventGroupSetBits(s_wifi_event_group, WIFI_FAIL_BIT);
      }
    } else {
      ESP_LOGD(TAG, "WIFI_EVENT_STA_DISCONNECTED - did not try to re-connect "
                    "since WiFi was commanded off");
    }
  } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
    ip_event_got_ip_t *event = (ip_event_got_ip_t *)event_data;
    ESP_LOGI(TAG, "IP_EVENT_STA_GOT_IP:" IPSTR, IP2STR(&event->ip_info.ip));
    sprintf(CURRENT_CLIENT_IP, IPSTR, IP2STR(&event->ip_info.ip));
    s_retry_num = 0;
    xEventGroupSetBits(s_wifi_event_group, WIFI_CONNECTED_BIT);
  }
}

void start_mdns_service() {
  esp_err_t err = mdns_init();
  if (err) {
    printf("MDNS Init failed: %d\n", err);
    return;
  }
  ESP_ERROR_CHECK(mdns_hostname_set("dronebridge"));
  ESP_ERROR_CHECK(mdns_instance_name_set("DroneBridge for ESP32"));

  ESP_ERROR_CHECK(mdns_service_add(NULL, "_http", "_tcp", 80, NULL, 0));
  ESP_ERROR_CHECK(
      mdns_service_add(NULL, "_db_proxy", "_tcp", APP_PORT_PROXY, NULL, 0));
  ESP_ERROR_CHECK(
      mdns_service_add(NULL, "_db_comm", "_tcp", APP_PORT_COMM, NULL, 0));
  ESP_ERROR_CHECK(
      mdns_service_instance_name_set("_http", "_tcp", "DroneBridge for ESP32"));
  ESP_LOGI(TAG, "MDNS Service started!");
}

#if CONFIG_WEB_DEPLOY_SEMIHOST
esp_err_t init_fs(void) {
  esp_err_t ret = esp_vfs_semihost_register(CONFIG_WEB_MOUNT_POINT,
                                            CONFIG_HOST_PATH_TO_MOUNT);
  if (ret != ESP_OK) {
    ESP_LOGE(TAG, "Failed to register semihost driver (%s)!",
             esp_err_to_name(ret));
    return ESP_FAIL;
  }
  return ESP_OK;
}
#endif

