valentindanev/esp32_sonar_bridge/firmware/main/main.c
#if CONFIG_WEB_DEPLOY_SF

esp_err_t init_fs(void) {
  esp_vfs_spiffs_conf_t conf = {.base_path = CONFIG_WEB_MOUNT_POINT,
                                .partition_label = NULL,
                                .max_files = 5,
                                .format_if_mount_failed = false};
  esp_err_t ret = esp_vfs_spiffs_register(&conf);

  if (ret != ESP_OK) {
    if (ret == ESP_FAIL) {
      ESP_LOGE(TAG, "Failed to mount or format filesystem");
    } else if (ret == ESP_ERR_NOT_FOUND) {
      ESP_LOGE(TAG, "Failed to find SPIFFS partition");
    } else {
      ESP_LOGE(TAG, "Failed to initialize SPIFFS (%s)", esp_err_to_name(ret));
    }
    return ESP_FAIL;
  }

  size_t total = 0, used = 0;
  ret = esp_spiffs_info(NULL, &total, &used);
  if (ret != ESP_OK) {
    ESP_LOGE(TAG, "Failed to get SPIFFS partition information (%s)",
             esp_err_to_name(ret));
  } else {
    ESP_LOGI(TAG,
             "Filesystem init finished! Partition size: total: %d bytes, used: "
             "%d bytes (%i%%)",
             total, used, (used * 100) / total);
  }
  return ret;
}

#endif

/**
 * Launches an access point where ground stations can connect to
 *
 * @param wifi_mode Allows to overwrite an AP mode from traditional WiFi to LR
 * Mode
 */
void db_init_wifi_apmode(int wifi_mode) {
  db_cleanup_wifi_runtime();
  ESP_ERROR_CHECK(esp_netif_init());
  ESP_ERROR_CHECK(esp_event_loop_create_default());
  esp_default_netif = esp_netif_create_default_wifi_ap();
  wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
  ESP_ERROR_CHECK(esp_wifi_init(&cfg));
  ESP_ERROR_CHECK(esp_event_handler_instance_register(
      WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL,
      &s_wifi_any_id_handler));
  ESP_ERROR_CHECK(esp_event_handler_instance_register(
      IP_EVENT, IP_EVENT_AP_STAIPASSIGNED, &wifi_event_handler, NULL,
      &s_ap_staipassigned_handler));

  wifi_config_t wifi_config = {
      .ap = {.ssid = "DroneBridge ESP32 Init Error",
             .password = "dronebridge",
             .ssid_len = 0,
             .authmode = WIFI_AUTH_WPA2_PSK,
             .channel = db_param_channel.value.db_param_u8.value,
             .ssid_hidden = 0,
             .beacon_interval = 100,
             .max_connection = 10},
  };
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wstringop-truncation"
  // Set Wi-Fi SSID and password from the stored parameters
  if (strlen(DB_PARAM_WIFI_SSID) >= db_param_ssid.value.db_param_str.min_len) {
    db_copy_cstr((char *)wifi_config.ap.ssid, sizeof(wifi_config.ap.ssid),
                 DB_PARAM_WIFI_SSID);
  } else {
    // something is wrong - switch to default value
    db_copy_cstr((char *)wifi_config.ap.ssid, sizeof(wifi_config.ap.ssid),
                 (char *)db_param_ssid.value.db_param_str.default_value);
  }
  if (strlen(DB_PARAM_PASS) >= db_param_pass.value.db_param_str.min_len) {
    db_copy_cstr((char *)wifi_config.ap.password,
                 sizeof(wifi_config.ap.password), DB_PARAM_PASS);
  } else {
    // something is wrong - switch to default value
    db_copy_cstr((char *)wifi_config.ap.password,
                 sizeof(wifi_config.ap.password),
                 (char *)db_param_pass.value.db_param_str.default_value);
  }
#pragma GCC diagnostic pop

  ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_AP));
  if (wifi_mode == DB_WIFI_MODE_AP_LR) {
    ESP_LOGI(TAG, "Enabling LR Mode on access point. This device will be "
                  "invisible to non-ESP32 devices!");
    ESP_ERROR_CHECK(esp_wifi_set_protocol(WIFI_IF_AP, WIFI_PROTOCOL_11B |
                                                          WIFI_PROTOCOL_LR));
  } else {
    ESP_ERROR_CHECK(esp_wifi_set_protocol(WIFI_IF_AP, WIFI_PROTOCOL_11B));
  }
  ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &wifi_config));
  wifi_country_t wifi_country = {.cc = "US",
                                 .schan = 1,
                                 .nchan = 13,
                                 .policy = WIFI_COUNTRY_POLICY_MANUAL};
  ESP_ERROR_CHECK(esp_wifi_set_country(&wifi_country));
  ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE));
  ESP_ERROR_CHECK(esp_wifi_start());
  DB_RADIO_IS_OFF = false; // just to be sure, but should not be necessary

  /* Assign IP to ap/gateway */
  esp_netif_ip_info_t ip;
  memset(&ip, 0, sizeof(esp_netif_ip_info_t));
  ip.ip.addr = ipaddr_addr(DB_PARAM_AP_IP);
  ip.netmask.addr = ipaddr_addr("255.255.255.0");
  ip.gw.addr = ipaddr_addr(DB_PARAM_AP_IP);
  ESP_ERROR_CHECK(esp_netif_dhcps_stop(esp_default_netif));
  ESP_ERROR_CHECK(esp_netif_set_ip_info(esp_default_netif, &ip));
  ESP_ERROR_CHECK(esp_netif_dhcps_start(esp_default_netif));

  ESP_ERROR_CHECK(esp_netif_set_hostname(
      esp_default_netif,
      (char *)db_param_wifi_hostname.value.db_param_str.value));
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wstringop-truncation"
  db_copy_cstr(CURRENT_CLIENT_IP, sizeof(CURRENT_CLIENT_IP), DB_PARAM_AP_IP);
#pragma GCC diagnostic pop
  ESP_ERROR_CHECK(esp_read_mac(LOCAL_MAC_ADDRESS, ESP_MAC_WIFI_SOFTAP));
}

/**
 * Initializes the ESP Wi-fi client/station mode where we connect to a known
 * access point.
 */
int db_init_wifi_clientmode() {
  db_cleanup_wifi_runtime();
  s_wifi_event_group = xEventGroupCreate();
  ESP_ERROR_CHECK(esp_netif_init());
  ESP_ERROR_CHECK(esp_event_loop_create_default());
  esp_default_netif = esp_netif_create_default_wifi_sta();
  assert(esp_default_netif);
  ESP_ERROR_CHECK(esp_netif_set_hostname(
      esp_default_netif,
      (char *)db_param_wifi_hostname.value.db_param_str.value));

  wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
  ESP_ERROR_CHECK(esp_wifi_init(&cfg));
  ESP_ERROR_CHECK(esp_event_handler_instance_register(
      WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL,
      &s_wifi_any_id_handler));
  ESP_ERROR_CHECK(esp_event_handler_instance_register(
      IP_EVENT, IP_EVENT_STA_GOT_IP, &wifi_event_handler, NULL,
      &s_sta_got_ip_handler));

  bool is_deeper_sta = db_is_deeper_sta_target();
  bool is_deeper_open = is_deeper_sta && strlen(DB_PARAM_PASS) == 0;
  wifi_config_t wifi_config = {
      .sta = {.ssid = "DroneBridge_ESP32_Init",
              .password = "dronebridge",
              .threshold.authmode =
                  is_deeper_open ? WIFI_AUTH_OPEN
                                 : (is_deeper_sta ? WIFI_AUTH_WPA_PSK
                                                  : WIFI_AUTH_WEP)},
  };
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wstringop-truncation"
  // Set Wi-Fi SSID and password from the stored parameters
  if (strlen(DB_PARAM_WIFI_SSID) >= db_param_ssid.value.db_param_str.min_len) {
    db_copy_cstr((char *)wifi_config.sta.ssid, sizeof(wifi_config.sta.ssid),
                 DB_PARAM_WIFI_SSID);
  } else {
    // something is wrong - switch to default value
    db_copy_cstr((char *)wifi_config.sta.ssid, sizeof(wifi_config.sta.ssid),
                 (char *)db_param_ssid.value.db_param_str.default_value);
  }
  if (is_deeper_open) {
    wifi_config.sta.password[0] = '\0';
    ESP_LOGI(TAG, "Using open security for Deeper STA connection");
  } else if (is_deeper_sta) {
    db_copy_cstr((char *)wifi_config.sta.password,
                 sizeof(wifi_config.sta.password), DB_PARAM_PASS);
    ESP_LOGI(TAG, "Using configured password for Deeper STA connection");
  } else if (strlen(DB_PARAM_PASS) >=
             db_param_pass.value.db_param_str.min_len) {
    db_copy_cstr((char *)wifi_config.sta.password,
                 sizeof(wifi_config.sta.password), DB_PARAM_PASS);
  } else {
    // something is wrong - switch to default value
    db_copy_cstr((char *)wifi_config.sta.password,
                 sizeof(wifi_config.sta.password),
                 (char *)db_param_pass.value.db_param_str.default_value);
  }
#pragma GCC diagnostic pop

  ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
  bool force_gn_for_deeper = is_deeper_sta;
  if (force_gn_for_deeper && !DB_PARAM_WIFI_EN_GN) {
    ESP_LOGI(TAG, "Forcing 802.11b/g/n compatibility for Deeper STA "
                  "connection");
  }
  if (DB_PARAM_WIFI_EN_GN || force_gn_for_deeper) {
    // only makes sense if the AP can not do proper N or you do not need range
    // or want Wi-Fi 6 ax support
#ifdef CONFIG_IDF_TARGET_ESP32C6
    ESP_ERROR_CHECK(esp_wifi_set_protocol(
        WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N |
                         WIFI_PROTOCOL_11AX | WIFI_PROTOCOL_LR));
#else
    ESP_ERROR_CHECK(esp_wifi_set_protocol(
        WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N |
                         WIFI_PROTOCOL_LR));
#endif
  } else {
    ESP_ERROR_CHECK(esp_wifi_set_protocol(
        WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_LR)); // range for sure
  }
  ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
  ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE)); // disable power saving
  ESP_ERROR_CHECK(esp_wifi_start());
  DB_RADIO_IS_OFF = false; // just to be sure, but should not be necessary
  // Consider connection lost after 1s of no beacon - triggers reconnect via
  // WIFI_EVENT_STA_DISCONNECTED event
  ESP_ERROR_CHECK(esp_wifi_set_inactive_time(WIFI_IF_STA, 3));

  ESP_LOGI(TAG, "Init of WiFi Client-Mode finished. (SSID: %s PASS: %s)",
           DB_PARAM_WIFI_SSID, db_wifi_password_for_log());

  /* Waiting until either the connection is established (WIFI_CONNECTED_BIT) or
   * connection failed for the maximum number of re-tries (WIFI_FAIL_BIT). The
   * bits are set by event_handler() (see above) */
  EventBits_t bits = xEventGroupWaitBits(s_wifi_event_group,
                                         WIFI_CONNECTED_BIT | WIFI_FAIL_BIT,
                                         pdFALSE, pdFALSE, portMAX_DELAY);

