valentindanev/esp32_sonar_bridge/firmware/main/main.c
  /* xEventGroupWaitBits() returns the bits before the call returned, hence we
   * can test which event actually happened. */
  bool enable_temp_ap_mode = false;
  if (bits & WIFI_CONNECTED_BIT) {
    ESP_LOGI(TAG, "Connected to ap SSID:%s password:%s", DB_PARAM_WIFI_SSID,
             db_wifi_password_for_log());
  } else if (bits & WIFI_FAIL_BIT) {
    ESP_LOGW(TAG, "Failed to connect to SSID:%s, password:%s",
             DB_PARAM_WIFI_SSID, db_wifi_password_for_log());
    enable_temp_ap_mode = true;
  } else {
    ESP_LOGE(TAG, "UNEXPECTED WIFI EVENT");
  }
  if (enable_temp_ap_mode) {
    ESP_LOGW(TAG, "WiFi client mode was not able to connect to the specified "
                  "access point");
    db_cleanup_wifi_runtime();
    // Return -1 so app_main knows we failed
    return -1;
  }

  ESP_LOGI(TAG, "WiFi client mode enabled and connected!");
  ESP_ERROR_CHECK(esp_read_mac(LOCAL_MAC_ADDRESS, ESP_MAC_WIFI_STA));
  return 0;
}

/**
 * Initialize Wi-Fi for ESP-NOW mode.
 * If someone uses ESP-NOW over Wi-Fi it is because he wants range over
 * everything else. LR mode makes it very inconvenient to change settings but
 * gives the most range. No AP mode since AP will not be visible.
 */
void db_init_wifi_espnow() {
  ESP_LOGI(TAG, "Setting up Wi-Fi for ESP-NOW");
  db_cleanup_wifi_runtime();
  ESP_ERROR_CHECK(esp_netif_init());
  ESP_ERROR_CHECK(esp_event_loop_create_default());
  wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
  ESP_ERROR_CHECK(esp_wifi_init(&cfg));
  ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));
  ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
  ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE));
  ESP_ERROR_CHECK(esp_wifi_start());
  ESP_ERROR_CHECK(
      esp_wifi_set_channel(DB_PARAM_CHANNEL, WIFI_SECOND_CHAN_NONE));
  ESP_ERROR_CHECK(
      esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_LR));
  ESP_LOGI(TAG, "Enabled ESP-NOW WiFi Mode! LR Mode is set. This device will "
                "be invisible to non-ESP32 devices!");
  ESP_ERROR_CHECK(esp_read_mac(LOCAL_MAC_ADDRESS, ESP_MAC_WIFI_STA));
}

/**
 * Enables or disables (via reboot) the Wi-Fi/BLE if the
 * DB_PARAM_DIS_RADIO_ON_ARM parameter is set. Not used during boot. Usually
 * called when arm state change of the autopilot is detected. As internal check
 * if the Wi-Fi is already enabled/disabled Wi-Fi must be inited first (done
 * during boot).
 *
 * This is handy for modes like BLE & WiFi AP which are used to configure the
 * drone and usually do not act as a long range telemetry link. In these cases
 * interference on the drone can be reduced by disabling the radio.
 *
 * @param enable_wifi True to enable the Wi-Fi and FALSE to disable it
 */
void db_set_radio_status(uint8_t enable_wifi) {
  if (DB_PARAM_DIS_RADIO_ON_ARM) { // check if the user enables that feature
    if (enable_wifi && DB_RADIO_IS_OFF) {
      ESP_LOGI(TAG, "Rebooting ESP32 to re-enable Wi-Fi/BLE");
      esp_restart(); // enable Wi-Fi/BLE by restarting ESP32 - an easy way to
                     // make sure all things are set up right
    } else if (!enable_wifi && !DB_RADIO_IS_OFF) {
      ESP_LOGI(TAG, "Disabling Wi-Fi/BLE");
      if (DB_PARAM_RADIO_MODE == DB_BLUETOOTH_MODE) {
        db_ble_deinit(); // disable BLE
        DB_RADIO_IS_OFF = true;
      } else {
        if (esp_wifi_stop() == ESP_OK) { // disable WiFi
          DB_RADIO_IS_OFF = true;
        } else {
          ESP_LOGW(TAG, "db_set_radio_status tried to disable Wi-Fi. FAILED");
        }
      }
    }
  } else {
    // nothing to do
  }
}

/**
 * Write settings to non-volatile memory so they can be loaded on next startup.
 * The UDP clients are saved using a separate function since the "save"
 * operation is triggered by a separate button on the UI.
 */
void db_write_settings_to_nvs() {
  // print parameters to console for logging
  ESP_LOGI(TAG, "Trying to save parameters:");
  uint8_t param_str_buffer[512] = {0};
  db_param_print_values_to_buffer(param_str_buffer);
  ESP_LOGI(TAG, "%s", param_str_buffer);
  ESP_LOGI(TAG, "Saving to NVS %s", NVS_NAMESPACE);
  nvs_handle_t my_handle;
  ESP_ERROR_CHECK(nvs_open(NVS_NAMESPACE, NVS_READWRITE, &my_handle));
  db_param_write_all_params_nvs(&my_handle);
  ESP_ERROR_CHECK(nvs_commit(my_handle));
  nvs_close(my_handle);
  ESP_LOGI(TAG, "Finished saving operation.");
}

/**
 * Saves an udp client to the NVM so it can be automatically added on the next
 * boot. No need for the user to manually add it again. Only one UDP client can
 * be saved to the NVM.
 * @param new_db_udp_client The client to add to NVM. Must have IP and port set.
 * @param clear_client Set to true to remove the current client from NVM. In
 * that case the new_db_udp_client param will be ignored.
 */
void save_udp_client_to_nvm(struct db_udp_client_t *new_db_udp_client,
                            bool clear_client) {
  char ip[INET_ADDRSTRLEN];
  uint16_t port;
  if (!clear_client) {
    // convert addr to string
    char client_str[INET_ADDRSTRLEN + 6];
    inet_ntop(AF_INET, &(new_db_udp_client->udp_client.sin_addr), ip,
              INET_ADDRSTRLEN);
    port = ntohs(new_db_udp_client->udp_client.sin_port);
    snprintf(client_str, sizeof(client_str), "%s:%d", ip, port);
    ESP_LOGI(TAG, "Saving UDP client %s to NVS %s", client_str, NVS_NAMESPACE);
  } else {
    // clear client from NVM by setting string to empty "" and port to 0
    ip[0] = '\0';
    port = 0;
    ESP_LOGI(TAG, "Clearing UDP client from NVM");
  }

  nvs_handle my_handle;
  ESP_ERROR_CHECK(nvs_open(NVS_NAMESPACE, NVS_READWRITE, &my_handle));
  ESP_ERROR_CHECK(
      nvs_set_str(my_handle, (char *)db_param_udp_client_ip.db_name, ip));
  ESP_ERROR_CHECK(
      nvs_set_u16(my_handle, (char *)db_param_udp_client_port.db_name, port));

  ESP_ERROR_CHECK(nvs_commit(my_handle));
  nvs_close(my_handle);
}

/**
 * Read stored settings from internal storage including the saved UDP client.
 */
void db_read_settings_nvs() {
  nvs_handle my_handle;
  if (nvs_open(NVS_NAMESPACE, NVS_READONLY, &my_handle) != ESP_OK) {
    ESP_LOGI(
        TAG,
        "NVS namespace not found. Using default values, setting up NVS...");
    ESP_ERROR_CHECK(nvs_flash_erase());
    ESP_ERROR_CHECK(nvs_flash_init());

    // Set all parameters to their default values when flash is empty
    db_param_reset_all();

    // Now save these defaults to NVS
    db_write_settings_to_nvs();

