valentindanev/esp32_sonar_bridge/firmware/main/main.c
    // Print parameters to console for logging
    uint8_t param_str_buffer[512] = {0};
    db_param_print_values_to_buffer(param_str_buffer);
    ESP_LOGI(TAG, "Initialized with default values:\n%s",
             (char *)param_str_buffer);
  } else {
    ESP_LOGI(TAG, "Reading settings from NVS");
    db_param_read_all_params_nvs(&my_handle);
    nvs_close(my_handle);

    // print parameters to console for logging
    uint8_t param_str_buffer[512] = {0};
    db_param_print_values_to_buffer(param_str_buffer);
    ESP_LOGI(TAG, "%s", (char *)param_str_buffer);

    // Check if we have a saved UDP client from the last session. Add it to the
    // known udp clients if there is one.
    if (strlen((char *)db_param_udp_client_ip.value.db_param_str.value) > 0 &&
        db_param_udp_client_port.value.db_param_u16.value != 0) {
      // there was a saved UDP client in the NVM from last session - add it to
      // the udp clients list
      ESP_LOGI(TAG, "Adding %s:%i to known UDP clients.",
               (char *)db_param_udp_client_ip.value.db_param_str.value,
               db_param_udp_client_port.value.db_param_u8.value);
      struct sockaddr_in new_sockaddr;
      memset(&new_sockaddr, 0, sizeof(new_sockaddr));
      new_sockaddr.sin_family = AF_INET;
      inet_pton(AF_INET,
                (char *)db_param_udp_client_ip.value.db_param_str.value,
                &new_sockaddr.sin_addr);
      new_sockaddr.sin_port =
          htons(db_param_udp_client_port.value.db_param_u16.value);
      struct db_udp_client_t new_udp_client = {
          .udp_client = new_sockaddr, .mac = {0, 0, 0, 0, 0, 0} // dummy MAC
      };
      bool save_to_nvm = false; // no need to save it to NVM again
      add_to_known_udp_clients(udp_conn_list, new_udp_client, save_to_nvm);
    } else {
      // no saved UDP client - do nothing
      ESP_LOGI(TAG, "No saved UDP client - skipping");
    }
  }
}

/**
 * Callback for a short press (<CONFIG_BUTTON_SHORT_PRESS_TIME_MS) of the
 * reset/boot button. Sets mode to WiFi access point mode with default password
 * "dronebridge" so user can check/change the config
 * @param arg
 */
void short_press_callback(void *arg, void *usr_data) {
  ESP_LOGW(TAG, "Short press detected setting wifi mode to access point with "
                "password: dronebridge");
  DB_RADIO_MODE_DESIGNATED =
      DB_WIFI_MODE_AP; // Do not directly change DB_PARAM_RADIO_MODE since it is
                       // not safe and constantly processed by other tasks. Save
                       // settings and reboot will assign
                       // DB_RADIO_MODE_DESIGNATED to DB_PARAM_RADIO_MODE.
  db_param_set_to_default(&db_param_ssid);
  db_param_set_to_default(&db_param_pass);
  db_write_settings_to_nvs();
  esp_restart();
}

/**
 * Callback for a long press (>CONFIG_BUTTON_LONG_PRESS_TIME_MS) of the
 * reset/boot button. Resets all settings to defaults.
 * @param arg
 */
void long_press_callback(void *arg, void *usr_data) {
  ESP_LOGW(TAG, "Reset triggered via GPIO %i. Resetting settings and rebooting",
           DB_RESET_PIN);
  DB_RADIO_MODE_DESIGNATED =
      DB_WIFI_MODE_AP; // Do not directly change DB_PARAM_RADIO_MODE since it is
                       // not safe and constantly processed by other tasks. Save
                       // settings and reboot will assign
                       // DB_RADIO_MODE_DESIGNATED to DB_PARAM_RADIO_MODE.
  db_param_reset_all();
  db_write_settings_to_nvs();
  esp_restart();
}

/**
 * Set up the boot button GPIO to reset entire ESP32 settings and to force a
 * reboot of the system
 */
void set_reset_trigger() {
  button_config_t gpio_btn_cfg = {
      .long_press_time = CONFIG_BUTTON_LONG_PRESS_TIME_MS,
      .short_press_time = CONFIG_BUTTON_SHORT_PRESS_TIME_MS,
  };
  button_gpio_config_t btn_gpio_cfg = {
      .gpio_num = DB_RESET_PIN,
      .active_level = 0,
  };
  button_handle_t gpio_btn = NULL;
  ESP_ERROR_CHECK(
      iot_button_new_gpio_device(&gpio_btn_cfg, &btn_gpio_cfg, &gpio_btn));
  if (NULL == gpio_btn) {
    ESP_LOGE(TAG, "Button create failed");
  } else {
    iot_button_register_cb(gpio_btn, BUTTON_SINGLE_CLICK, NULL,
                           short_press_callback, NULL);
    iot_button_register_cb(gpio_btn, BUTTON_LONG_PRESS_UP, NULL,
                           long_press_callback, NULL);
  }
}

/**
 * For simple debugging when serial via JTAG is enabled. Printed once control
 * module configured USB serial socket. Write settings to JTAG/USB, so we can
 * debug issues better
 */
void db_jtag_serial_info_print() {
  uint8_t buffer[512];
  const int len = db_param_print_values_to_buffer(buffer);
  write_to_serial(buffer, len);
}

/**
 * 1. Checks if RF Switch is configured.
 * 2. Enables RF switch (necessary on some boards).
 * 3. Sets RF switch according to user setting.
 * Must be called before radio/Wi-Fi gets initialized!
 */
void db_configure_antenna() {
#if defined(CONFIG_DB_HAS_RF_SWITCH) && defined(CONFIG_DB_RF_SWITCH_GPIO) &&   \
    (CONFIG_DB_RF_SWITCH_GPIO != 0)
#ifdef CONFIG_DB_OFFICIAL_BOARD_1_X_C6
  gpio_set_direction(GPIO_NUM_3, GPIO_MODE_OUTPUT);
  gpio_set_level(GPIO_NUM_3, 0); // set to low to enable RF switching
#endif
  gpio_set_direction(CONFIG_DB_RF_SWITCH_GPIO, GPIO_MODE_OUTPUT);
  gpio_set_level(
      CONFIG_DB_RF_SWITCH_GPIO,
      DB_PARAM_EN_EXT_ANT); // set level to enable external/internal antenna
  ESP_LOGI(TAG, "External antenna usage: %i", DB_PARAM_EN_EXT_ANT);
#endif
}

/**
 * Main entry point.
 */
void app_main() {
  bool deeper_sta_connected = false;

  db_param_init_parameters();
  udp_conn_list =
      udp_client_list_create(); // http server functions and
                                // db_read_settings_nvs expect the list to exist
  esp_err_t ret = nvs_flash_init();
  if (ret == ESP_ERR_NVS_NO_FREE_PAGES) {
    ESP_ERROR_CHECK(nvs_flash_erase());
    ret = nvs_flash_init();
  }
  ESP_ERROR_CHECK(ret);
  db_read_settings_nvs();
  DB_RADIO_MODE_DESIGNATED =
      DB_PARAM_RADIO_MODE; // must always match, mismatch only allowed when
                           // changed by user action and not rebooted, yet.
  db_configure_antenna();

  // Initialize hardwired sonar task on Core 1
  danevi_sonar_init(DB_PARAM_SONAR_TX_GPIO, DB_PARAM_SONAR_RX_GPIO);

