valentindanev/esp32_sonar_bridge/firmware/main/main.c
  switch (DB_PARAM_RADIO_MODE) {
  case DB_WIFI_MODE_AP:
  case DB_WIFI_MODE_AP_LR:
    if (DB_PARAM_DEEPER_EN) {
      char original_wifi_ssid[MAX_SSID_LEN] = {0};
      char original_wifi_pass[DB_PARAM_VALUE_MAXLEN] = {0};
      db_copy_cstr(original_wifi_ssid, sizeof(original_wifi_ssid),
                   DB_PARAM_WIFI_SSID);
      db_copy_cstr(original_wifi_pass, sizeof(original_wifi_pass),
                   DB_PARAM_PASS);
      ESP_LOGI(TAG, "Deeper Sonar Fallback Enabled. Temporarily switching to "
                    "STA to scan for Deeper AP...");
      db_copy_cstr(DB_PARAM_WIFI_SSID, db_param_ssid.value.db_param_str.max_len,
                   DB_PARAM_DEEPER_SSID);
      db_copy_cstr(DB_PARAM_PASS, db_param_pass.value.db_param_str.max_len,
                   DB_PARAM_DEEPER_PASS);

      if (db_init_wifi_clientmode() < 0) {
        ESP_LOGE(TAG, "STA Mode failed (Deeper not found). Falling back to "
                      "normal AP Mode.");

        // Restore AP config that was temporarily overwritten for the Deeper
        // probe without depending on a second NVS read here.
        db_copy_cstr(DB_PARAM_WIFI_SSID,
                     db_param_ssid.value.db_param_str.max_len,
                     original_wifi_ssid);
        db_copy_cstr(DB_PARAM_PASS, db_param_pass.value.db_param_str.max_len,
                     original_wifi_pass);

        db_init_wifi_apmode(DB_PARAM_RADIO_MODE);
      } else {
        ESP_LOGI(TAG, "Deeper Fallback SUCCESS! We are now connected to the "
                      "Deeper Sonar AP.");
        deeper_sta_connected = true;
        // Keep DB_PARAM_RADIO_MODE technically as AP so the WebUI doesn't
        // permanently change to STA
      }
    } else {
      db_init_wifi_apmode(DB_PARAM_RADIO_MODE);
    }
    break;
  case DB_WIFI_MODE_ESPNOW_AIR:
  case DB_WIFI_MODE_ESPNOW_GND:
    db_init_wifi_espnow();
    db_start_espnow_module();
    break;
  case DB_BLUETOOTH_MODE:
#ifdef CONFIG_BT_ENABLED
    db_init_wifi_apmode(
        DB_WIFI_MODE_AP); // WiFi & BLE co-existence to enable webinterface
    db_ble_queue_init();
    db_ble_init();
#else
    DB_RADIO_MODE_DESIGNATED = DB_WIFI_MODE_AP;
    DB_PARAM_RADIO_MODE = DB_WIFI_MODE_AP;
    ESP_LOGE(TAG, "Bluetooth is not enabled with this build. Please enable it "
                  "in menuconfig and re-compile. Switching to AP mode.");
    db_init_wifi_apmode(DB_WIFI_MODE_AP);
#endif
    break;
  default:
    // Wi-Fi client mode with LR mode enabled
    if (db_init_wifi_clientmode() < 0) {
      ESP_LOGE(TAG, "Failed to init Wifi Client Mode");
      ESP_LOGI(TAG, "Falling back to AP mode");
      db_init_wifi_apmode(DB_WIFI_MODE_AP);
    } else if (db_is_deeper_sta_target()) {
      deeper_sta_connected = true;
    }
    break;
  }

  if (DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_AIR &&
      DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_GND &&
      DB_PARAM_RADIO_MODE != DB_WIFI_MODE_AP_LR) {
    // no need to start these services - won`t be available anyway - safe the
    // resources
    start_mdns_service();
    netbiosns_init();
    netbiosns_set_name("dronebridge");
  }
  ESP_ERROR_CHECK(init_fs());
  db_start_control_module();
  if (deeper_sta_connected) {
    deeper_udp_sonar_start();
  }

  db_timer_start_mavlink_heartbeat();
  db_timer_start_mavlink_radio_status();
  db_timer_start_mavlink_sonar();

  if (DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_AIR &&
      DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_GND &&
      DB_PARAM_RADIO_MODE != DB_WIFI_MODE_AP_LR) {
    // no need to start these services - won`t be available anyway - safe the
    // resources
    ESP_ERROR_CHECK(start_rest_server(CONFIG_WEB_MOUNT_POINT));
    ESP_LOGI(TAG, "Rest Server started");
    // Disable legacy support for DroneBridge communication module - no use case
    // for DroneBridge for ESP32 communication_module();
  }
  ESP_LOGI(TAG, "app_main finished initial setup");
}
